<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

use Illuminate\Support\Facades\Storage;

use Illuminate\Support\Str;

use DB;

class BlogPostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        Storage::disk('public')->put("boket_1_t.jpg", file_get_contents(public_path('img/facer_img/tovars/tov_2.jpg')), 'public');
        Storage::disk('public')->put("boket_2_t.jpg", file_get_contents(public_path('img/facer_img/tovars/tov_3.jpg')), 'public');
        Storage::disk('public')->put("boket_3_t.jpg", file_get_contents(public_path('img/facer_img/tovars/tov_4.jpg')), 'public');
        Storage::disk('public')->put("boket_4_t.jpg", file_get_contents(public_path('img/facer_img/tovars/tov_5.jpg')), 'public');
        Storage::disk('public')->put("boket_5_t.jpg", file_get_contents(public_path('img/facer_img/tovars/tov_6.jpg')), 'public');
        Storage::disk('public')->put("boket_6_t.jpg", file_get_contents(public_path('img/facer_img/tovars/tov_7.jpg')), 'public');

        DB::table("blog_posts")->insert(
            [
                [
                    'title' => "Топ - 5 Экзотических цветов в сборных композициях",
                    'slug' => Str::slug("Топ - 5 Экзотических цветов в сборных композициях"),
                    'img' => Storage::url("boket_1_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Топ-5 видов зелени в букетах",
                    'slug' => Str::slug("Топ-5 видов зелени в букетах"),
                    'img' => Storage::url("boket_2_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Особенности осенних букетов и композиций",
                    'slug' => Str::slug("Особенности осенних букетов и композиций"),
                    'img' => Storage::url("boket_3_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Сиреневый оттенок в цветочных композициях",
                    'slug' => Str::slug("Сиреневый оттенок в цветочных композициях"),
                    'img' => Storage::url("boket_4_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Кому и когда дарят красные розы?",
                    'slug' => Str::slug("Кому и когда дарят красные розы?"),
                    'img' => Storage::url("boket_5_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Почему гипсофила популярна во флористике?",
                    'slug' => Str::slug("Почему гипсофила популярна во флористике?"),
                    'img' => Storage::url("boket_6_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],






                [
                    'title' => "Топ - 5 Экзотических цветов в сборных композициях-1",
                    'slug' => Str::slug("Топ - 5 Экзотических цветов в сборных композициях-1"),
                    'img' => Storage::url("boket_1_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Топ-5 видов зелени в букетах-1",
                    'slug' => Str::slug("Топ-5 видов зелени в букетах-1"),
                    'img' => Storage::url("boket_2_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Особенности осенних букетов и композиций-1",
                    'slug' => Str::slug("Особенности осенних букетов и композиций-1"),
                    'img' => Storage::url("boket_3_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Сиреневый оттенок в цветочных композициях-1",
                    'slug' => Str::slug("Сиреневый оттенок в цветочных композициях-1"),
                    'img' => Storage::url("boket_4_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Кому и когда дарят красные розы?-1",
                    'slug' => Str::slug("Кому и когда дарят красные розы?-1"),
                    'img' => Storage::url("boket_5_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Почему гипсофила популярна во флористике?-1",
                    'slug' => Str::slug("Почему гипсофила популярна во флористике?-1"),
                    'img' => Storage::url("boket_6_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],





                [
                    'title' => "Топ - 5 Экзотических цветов в сборных композициях-2",
                    'slug' => Str::slug("Топ - 5 Экзотических цветов в сборных композициях-2"),
                    'img' => Storage::url("boket_1_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Топ-5 видов зелени в букетах-2",
                    'slug' => Str::slug("Топ-5 видов зелени в букетах-2"),
                    'img' => Storage::url("boket_2_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Особенности осенних букетов и композиций-2",
                    'slug' => Str::slug("Особенности осенних букетов и композиций-2"),
                    'img' => Storage::url("boket_3_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Сиреневый оттенок в цветочных композициях-2",
                    'slug' => Str::slug("Сиреневый оттенок в цветочных композициях-2"),
                    'img' => Storage::url("boket_4_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Кому и когда дарят красные розы?-2",
                    'slug' => Str::slug("Кому и когда дарят красные розы?-2"),
                    'img' => Storage::url("boket_5_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],

                [
                    'title' => "Почему гипсофила популярна во флористике?-2",
                    'slug' => Str::slug("Почему гипсофила популярна во флористике?-2"),
                    'img' => Storage::url("boket_6_t.jpg"),
                    'description' => 'Оригинальные сборные букеты можно создать именно с этим цветком. Соцветия эрингиума похожи на чертополох, только синего оттенка. Причудливый, но сдержанный цветок флористы используют для формирования не только женских, но и мужских букетов. В сочетание с ним добавляются не менее интересные экзотические цветы, например, тритикум (пшеница), розы, декоративные сухоцветы или эвкалипт.'
                ],






            ]
        );
    }
}
