<section id="about_main">
    <div class="_wrapper">
            <div class="img_wraper">
                <img src="{{asset('img/about-picture.jpg')}}" alt="">
            </div>
            <div class="text_wrapper text_blk">
                <h2>Доставка цветов в Курске на официальном сайте «Флорида»!</h2>
                <p>Купить цветы в Курске –  это лучший способ выражения заботы, уважения, любви, симпатии и многих других чувств, которые вы испытываете к дорогому сердцу человеку, близкому другу или уважаемому коллеге. Ведь, согласитесь, приятно не только получать букеты, но и преподносить их лично, вызывая тем самым массу положительных эмоций у адресата.</p>
                <p>Мы доставляем цветы во все районы города, как частным лицам, так и организациям, и предпринимателям. Оптовым покупателям предлагается гибкая система скидок. Принимаем предзаказы на изготовление большого количества букетов. Если вы думаете о том, как поздравить коллег с 8 марта, обращайтесь к нам. Мы подберем для вас самые лучшие варианты композиций, которые поразят ваших женщин.</p>
                <p>Удобная навигация каталога позволяет быстро выбрать необходимый букет. Вы можете подобрать не только композиции по тематике, но и подобрать нужный вариант в разделах по видам букетов. У нас можно заказать не только классический букет цветов, но и с добавлением нотки экзотики. Не бойтесь фантазировать вместе с нами. При составлении композиции  мы всегда учитываем пожелания заказчика. Вместе мы создадим самые великолепные букеты!</p>
                <a class="btn read_more btn_icon_after" href="#">Читать далее</a>
            </div>
    </div>
</section>
