@extends('layouts.all')

@php
    $title = "Бонусная программа нашего магазина";
    $description = "Бонусная программа нашего магазина. Покупайте букеты с выгодой, накапли";
@endphp

@section('title', $title)
@section('description', $description)

@section('content')

<x-headers.header-inner :h1="$title"></x-headers.header-inner>

<section class="thencs_page">
    <div class="_wrapper">
        <div class="text_blk">
            <p>В FLORIDA мы ценим каждого клиента — и хотим, чтобы ваши покупки приносили не только радость, но и ощутимую выгоду. Именно поэтому у нас действует продуманная и прозрачная система лояльности с прогрессивными бонусами.</p>

            <p>За каждый заказ мы начисляем бонусы — от 3 % до целых 7 % от суммы покупки! А самое приятное: 1 балл = 1 рубль, и этими баллами можно оплатить до 30 % стоимости вашего букета. Представьте: часть любимого букета — в подарок от нас! 🎁</p>

            <p>Чем больше общая сумма ваших покупок, тем выше процент:</p>
            <ul>
                <li>до 30 000 ₽ — 3 %;</li>
                <li>30 000–100 000 ₽ — 4 %;</li>
                <li>100 000–200 000 ₽ — 5 %;</li>
                <li>200 000–500 000 ₽ — 6 %;</li>
                <li>от 500 000 ₽ — 7 %.</li>
            </ul>

            <p>Стать участником невероятно просто! Если вы делаете заказ на нашем сайте — вы автоматически становитесь частью программы лояльности: никаких лишних действий, всё работает за вас. А если предпочитаете выбирать букет лично в нашем магазине — просто оставьте свои контакты продавцу, и вы сразу присоединитесь к программе.</p>

            <p>Сейчас воспользоваться накопленными бонусами и получить скидку можно при покупке в магазине — порадуйте себя выгодным приобретением! Совсем скоро такая возможность появится и на нашем сайте: вы сможете оплачивать бонусами любимые букеты онлайн. Следите за обновлениями — впереди ещё больше приятных сюрпризов! 😊</p>
        </div>
    </div>
</section>

@endsection